Autodesk.Revit.DB.BasicFileInfo.Extract(System.String)
Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path
file:
The full path to the file to be queried, including project (.rvt) and family (.rfa) files.
Returns:
If successful, basic file data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A file is saved in very old version of Revit without basic file data.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.IsSavedInLaterVersion
Checks if the file is saved in a later version of Revit than the running Revit.
Since:
2017

Autodesk.Revit.DB.BasicFileInfo.IsCreatedLocal
Checks if the file is created local.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo
Encapsulates basic information about a Revit file, including worksharing status, Revit version, username and central path.
Remarks:
This class provides a fast access to get basic information without fully opening a Revit file. The
Extract method
can initialize a new instance of this class by providing a full path for Revit file, including project (.rvt) and family (.rfa) files.
It's the only way to initialize this class.
Since:
2013